---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.IsDone
source: html/c2ba476c-1320-cf82-9fb3-6f2535761d83.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.